## Grupo
<table width="300" border="2">
    <tr>
        <td><b>Nome do Aluno</b> </td>
        <td><b>RA</b></td>
     </tr>  
   <tr>
       <td>André Matteucci</td>
       <td>10403403</td>
   </tr>
   <tr>
       <td>Enzo Koji</td>
       <td>10403411</td>
   </tr>
   <tr>
       <td>Felipe Ribeiro</td>
       <td>10400831</td>
   </tr>
</table>

## Dataset

### Licença

Este projeto utiliza o [dataset HMEQ_Data](https://www.kaggle.com/datasets/ajay1735/hmeq-data), publicado originalmente por [Ajay Vallala (ajay1735)](https://www.kaggle.com/ajay1735) no Kaggle.

**Licença**: [CC0 1.0 Universal (Domínio Público)](https://creativecommons.org/publicdomain/zero/1.0/)

### Descrição

| Coluna  | Descrição                                                |
|---------|----------------------------------------------------------|
| BAD     | 1 = client defaulted on loan; 0 = loan repaid            |
| LOAN    | Amount of the loan request                               |
| MORTDUE | Amount due on existing mortgage                          |
| VALUE   | Value of current property                                |
| REASON  | DebtCon = debt consolidation; HomeImp = home improvement |
| JOB     | Six occupational categories                              |
| YOJ     | Years at present job                                     |
| DEROG   | Number of major derogatory reports                       |
| DELINQ  | Number of delinquent credit lines                        |
| CLAGE   | Age of oldest trade line in months                       |
| NINQ    |                                                          |
| CLNO    |                                                          |
| DEBTINC |                                                          |

In [66]:
%pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [67]:
import pandas as pd

In [68]:
df = pd.read_csv("hmeq.csv")

In [69]:
df.head()

,BAD,LOAN,MORTDUE,VALUE,REASON,JOB,YOJ,DEROG,DELINQ,CLAGE,NINQ,CLNO,DEBTINC
0,1,1100,25860.0,39025.0,HomeImp,Other,10.5,0.0,0.0,94.366667,1.0,9.0,NaN
1,1,1300,70053.0,68400.0,HomeImp,Other,7.0,0.0,2.0,121.833333,0.0,14.0,NaN
2,1,1500,13500.0,16700.0,HomeImp,Other,4.0,0.0,0.0,149.466667,1.0,10.0,NaN
3,1,1500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,0,1700,97800.0,112000.0,HomeImp,Office,3.0,0.0,0.0,93.333333,0.0,14.0,NaN

In [70]:
df.shape

(5960, 13)

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5960 entries, 0 to 5959
Data columns (total 13 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   BAD      5960 non-null   int64
 1   LOAN     5960 non-null   int64
 2   MORTDUE  5442 non-null   float64
 3   VALUE    5848 non-null   float64
 4   REASON   5708 non-null   object
 5   JOB      5681 non-null   object
 6   YOJ      5445 non-null   float64
 7   DEROG    5252 non-null   float64
 8   DELINQ   5380 non-null   float64
 9   CLAGE    5652 non-null   float64
 10  NINQ     5450 non-null   float64
 11  CLNO     5738 non-null   float64
 12  DEBTINC  4693 non-null   float64
dtypes: float64(9), int64(2), object(2)
memory usage: 605.4+ KB

In [72]:
print(df.dtypes)

BAD          int64
LOAN         int64
MORTDUE    float64
VALUE      float64
REASON      object
JOB         object
YOJ        float64
DEROG      float64
DELINQ     float64
CLAGE      float64
NINQ       float64
CLNO       float64
DEBTINC    float64
dtype: object

### Valores duplicados

In [73]:
print(df.duplicated().sum())

0

### Valores nulos

In [74]:
null_values = df.isnull().sum()
null_percent = 100 * null_values / len(df)
null_df = pd.DataFrame({
    '#': null_values,
    '%': null_percent.round(2)
})

null_df[null_df['#'] > 0].sort_values('%', ascending=False)

            #      %
DEBTINC  1267  21.26
DEROG     708  11.88
DELINQ    580   9.73
MORTDUE   518   8.69
YOJ       515   8.64
NINQ      510   8.56
CLAGE     308   5.17
JOB       279   4.68
REASON    252   4.23
CLNO      222   3.72
VALUE     112   1.88

In [75]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
BAD,5960.0,0.199497,0.399656,0.000000,0.000000,0.000000,0.000000,1.000000
LOAN,5960.0,18607.969799,11207.480417,1100.000000,11100.000000,16300.000000,23300.000000,89900.000000
MORTDUE,5442.0,73760.817200,44457.609458,2063.000000,46276.000000,65019.000000,91488.000000,399550.000000
VALUE,5848.0,101776.048741,57385.775334,8000.000000,66075.500000,89235.500000,119824.250000,855909.000000
YOJ,5445.0,8.922268,7.573982,0.000000,3.000000,7.000000,13.000000,41.000000
DEROG,5252.0,0.254570,0.846047,0.000000,0.000000,0.000000,0.000000,10.000000
DELINQ,5380.0,0.449442,1.127266,0.000000,0.000000,0.000000,0.000000,15.000000
CLAGE,5652.0,179.766275,85.810092,0.000000,115.116702,173.466667,231.562278,1168.233561
NINQ,5450.0,1.186055,1.728675,0.000000,0.000000,1.000000,2.000000,17.000000
CLNO,5738.0,21.296096,10.138933,0.000000,15.000000,20.000000,26.000000,71.000000
DEBTINC,4693.0,33.779915,8.601746,0.524499,29.140031,34.818262,39.003141,203.312149